{"id":1230,"date":"2023-01-26T15:32:13","date_gmt":"2023-01-26T15:32:13","guid":{"rendered":"https:\/\/verst.earth\/?p=1230"},"modified":"2023-04-10T12:05:11","modified_gmt":"2023-04-10T12:05:11","slug":"what-next-after-verras-consultation-with-blockchain-players","status":"publish","type":"post","link":"https:\/\/verst.earth\/what-next-after-verras-consultation-with-blockchain-players\/","title":{"rendered":"What next after Verra’s consultation with blockchain players?"},"content":{"rendered":"\n<p class=\"has-white-color has-text-color\">The Verified Carbon Standard, Verra, a global leader in developing and managing standards for carbon credits and other environmental commodities, recently conducted a <a href=\"https:\/\/verra.org\/wp-content\/uploads\/2023\/01\/Verras-Approach-To-Third-Party-Crypto-Instruments-And-Tokens-Public-Consultation-Summary-of-Comments-1.pdf\">consultation on its approach to third-party crypto instruments and tokens<\/a>. The consultation, which ran from 3 August to 1 November 2022, received input from 71 stakeholders, including industry groups, project proponents, professional developers, corporate buyers, environmental organizations, and the general public.<\/p>\n\n\n\n<p class=\"has-white-color has-text-color\">Verra <a href=\"https:\/\/verra.org\/verra-addresses-crypto-instruments-and-tokens\/\">prohibited the practice of creating instruments or tokens<\/a> based on retired credits (tokenization of carbon credits) in May 2022. This was done to give the registry ample time to consult stakeholders and set up systems for “immobilizing” credits in accounts in the Verra Registry so that they can be tokenized with the transparency and traceability that market participants demand, prevent fraud and uphold environmental integrity.<\/p>\n\n\n\n<p class=\"has-white-color has-text-color\">Verra’s consultation with stakeholders sought input on three main topics: measures to associate verified carbon units (VCUs) with crypto instruments or tokens, know your client (KYC) requirements, and amendments to the registry terms of use relating to anti-fraud. In summary, stakeholders provided the following main points of feedback on the three topics:<\/p>\n\n\n\n<ol class=\"has-vivid-green-cyan-color has-text-color\">\n<li>Measures to associate VCUs with crypto instruments or tokens<\/li>\n<\/ol>\n\n\n\n<p class=\"has-white-color has-text-color\">The first topic focused on the creation, transfer, and use of VCU-backed crypto instruments and tokens, and the safeguards that should be implemented by Verra to ensure environmental integrity, particularly to prevent double-issuance and double-use.<\/p>\n\n\n\n<p class=\"has-white-color has-text-color\">Stakeholders proposed several measures to ensure environmental integrity, such as tokenizing platforms undergoing rigorous security and accounting audits, embedding metadata into carbon tokens, and using digital measurement, reporting, and verification tools. To prevent double-issuance, stakeholders suggested embedding metadata about the underlying VCU into each carbon token and depositing metadata\/hashes of each carbon token into the Verra Registry. To prevent double-use, stakeholders proposed immobilizing VCUs used to generate carbon tokens in the Verra registry and using a trust structure where Verra maintains control over the carbon tokens and holds them in trust for the beneficial owner.<\/p>\n\n\n\n<p class=\"has-white-color has-text-color\">In terms of infrastructure and processes, some stakeholders were not keen on immobilization at all. However, others proposed a form of linkage between the Verra Registry and the blockchain on which the carbon tokens are issued, a specialized account set up in the Verra Registry to hold immobilized VCUs, and technological\/automated solutions to link the Verra Registry with the platform.<\/p>\n\n\n\n<ol start=\"2\" class=\"has-vivid-green-cyan-color has-text-color\">\n<li>Know your client (KYC) requirements<\/li>\n<\/ol>\n\n\n\n<p class=\"has-white-color has-text-color\">The second topic focused on the KYC checks that should be applied to platforms before authorizing them to issue, market, and\/or transact in crypto instruments or tokens that are backed by VCUs.<\/p>\n\n\n\n<p class=\"has-white-color has-text-color\">Stakeholders suggested two broad categories of KYC checks for platforms. The first category consisted of corporate KYC checks to ascertain the financial standing of the platform, as well as to check for the involvement of sanctioned entities and to run general anti-money laundering checks. The second category of KYC checks is related specifically to the processes and technical operations of the platforms, including cybersecurity audits, information about the processes and carbon footprint of the blockchain and the platform, licenses from local authorities to operate a platform, and the platform&#8217;s own KYC policies<\/p>\n\n\n\n<ol start=\"3\" class=\"has-vivid-green-cyan-color has-text-color\">\n<li>Amendments to the registry terms of use relating to antifraud<\/li>\n<\/ol>\n\n\n\n<p class=\"has-white-color has-text-color\">On the third topic, stakeholders proposed several amendments to the Registry Terms of Use (TOU) related to anti-fraud considerations for the association of third-party crypto instruments and tokens with VCUs. Most respondents either did not respond or did not propose any text, instead making general comments on what should be included in the TOU.<\/p>\n\n\n\n<p class=\"has-white-color has-text-color\">These include adding a section in TOU for the approval of Authorized Tokenization Platforms, specifying that the Verra Registry shall take priority over the approved platform in cases of conflict, and stating that Verra is the sole authority capable of reactivating VCUs. Additionally, stakeholders proposed that project proponents should promise to accept a public ID allocated by Verra, use it in communications and blockchain interactions, and ensure that emission reductions can no longer be transacted and become property of the buyer.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">WAY FORWARD<\/h3>\n\n\n\n<p class=\"has-white-color has-text-color\">Based on the feedback received during the consultation, it seems that Verra will need to consider implementing a range of measures to safeguard the environmental integrity of VCU-backed crypto instruments and tokens. These measures include implementing safeguards to prevent double-issuance and double-use, such as embedding metadata into carbon tokens and linking the tokens to the actual performance of a project. Additionally, Verra will need to consider the infrastructure and processes needed for entities participating in the immobilization approach, such as setting up a specialized account in the Verra Registry to hold immobilized VCUs and possibly creating a digital public ledger built on blockchain technology to record all transactions of Carbon Tokens.<\/p>\n\n\n\n<p class=\"has-white-color has-text-color\">Verra will also need to consider implementing KYC requirements for platforms before authorizing them to issue, market, and\/or transact in crypto instruments or tokens that are backed by VCUs. This includes both corporate KYC checks to ascertain the financial standing of the platform and anti-money laundering checks, as well as process and technical KYC checks such as cybersecurity audits, information about the processes and carbon footprint of the blockchain and the platform, and licenses from local authorities to operate a platform.<\/p>\n\n\n\n<p class=\"has-white-color has-text-color\">In terms of amendments to the Registry Terms of Use relating to anti-fraud, Verra will need to consider textual amendments to address anti-fraud considerations related to the association of third-party crypto instruments and tokens with VCUs. This could include clauses such as Verra being the sole authority capable of reactivating VCUs, Verra&#8217;s registry taking priority over the approved platform in cases of conflict, and a declaration that only Carbon Tokens that have real VCUs as collateralized assets are deemed valid for trading purposes on the approved platform.<\/p>\n\n\n\n<p class=\"has-white-color has-text-color\">Ultimately, this consultation is expected to result in clarity from Verra on the best and approved practices for players providing blockchain-based solutions in carbon markets. Other registries like <a href=\"https:\/\/www.goldstandard.org\/blog-item\/comment-blockchain-better-untangling-tokenisation-and-carbon-markets\">Gold Standard<\/a> have also shown interest in incorporating blockchain-based players in their ecosystems, a positive development for the growing number of climate start-ups that have integrated blockchain technology in their solutions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Verified Carbon Standard, Verra, a global leader in developing and managing standards for carbon credits and other environmental commodities, recently conducted [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[20],"tags":[],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/verst.earth\/wp-json\/wp\/v2\/posts\/1230"}],"collection":[{"href":"https:\/\/verst.earth\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/verst.earth\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/verst.earth\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/verst.earth\/wp-json\/wp\/v2\/comments?post=1230"}],"version-history":[{"count":3,"href":"https:\/\/verst.earth\/wp-json\/wp\/v2\/posts\/1230\/revisions"}],"predecessor-version":[{"id":1262,"href":"https:\/\/verst.earth\/wp-json\/wp\/v2\/posts\/1230\/revisions\/1262"}],"wp:attachment":[{"href":"https:\/\/verst.earth\/wp-json\/wp\/v2\/media?parent=1230"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/verst.earth\/wp-json\/wp\/v2\/categories?post=1230"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/verst.earth\/wp-json\/wp\/v2\/tags?post=1230"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}